R3X06/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED3_Pin GPIO_PIN_8
#define LED3_GPIO_Port GPIOE
#define MOTC_IN2_Pin GPIO_PIN_9
#define MOTC_IN2_GPIO_Port GPIOE
#define MOTC_IN1_Pin GPIO_PIN_11
#define MOTC_IN1_GPIO_Port GPIOE
#define MOTD_IN2_Pin GPIO_PIN_13
#define MOTD_IN2_GPIO_Port GPIOE
#define MOTD_IN1_Pin GPIO_PIN_14
#define MOTD_IN1_GPIO_Port GPIOE
#define MOTA_IN2_Pin GPIO_PIN_8
#define MOTA_IN2_GPIO_Port GPIOB
#define MOTA_IN1_Pin GPIO_PIN_9
#define MOTA_IN1_GPIO_Port GPIOB
#define USER_BTN_Pin GPIO_PIN_0
#define USER_BTN_GPIO_Port GPIOE
#define USER_BTN_EXTI_IRQn EXTI0_IRQn
#define IMU_INT_Pin GPIO_PIN_1
#define IMU_INT_GPIO_Port GPIOE
#define IMU_INT_EXTI_IRQn EXTI1_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
